package main

import "fmt"

func main() {
	//正数源码 反码 补码都一样
	//源码0000 0011
	//反码0000 0011
	//补码0000 0011
	var a int = 3

	//负数
	//源码0000 0010
	//反码1111 1101
	//补码=反码+1
	// 1111 1110
	var b int = -2

	//正数左移 乘以2的几次方
	fmt.Println(a << 2) //12
	//负数左移乘以2的几次方，操作时源码
	fmt.Println(b << 2) //-8

	//右移
	//正数右移最小值为0
	fmt.Println(a >> 1)
	//负数向右移动最小值是-1
	fmt.Println(b >> 2)

	// 逻辑运算 | 以补码运算
	fmt.Println(a | b) // 1111 1111 ->1111 1110->0000 0001 //-1;
	//逻辑运算 & 以补码运算
	fmt.Println(a & b) //0000 0010->0000 0010->0000 0010//2
	//异或相同为0 不同为1
	fmt.Println(a ^ b) // 1111 1101->1111 1100->0000 0011//3
	// &^位请空 如果右侧0 左侧不变；如果右侧为1 左侧一定清零
	fmt.Println(a &^ b) //0000 0001->0000->0001 0000 0001 //1

}
